; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-6nodes-1000size-3degree-100mindistance-2trucks-5packages-763seed

(define (problem transport-city-sequential-6nodes-1000size-3degree-100mindistance-2trucks-5packages-763seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  city-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 856,721 -> 535,681
  (road city-loc-2 city-loc-1)
  (= (road-length city-loc-2 city-loc-1) 33)
  ; 535,681 -> 856,721
  (road city-loc-1 city-loc-2)
  (= (road-length city-loc-1 city-loc-2) 33)
  ; 148,704 -> 535,681
  (road city-loc-3 city-loc-1)
  (= (road-length city-loc-3 city-loc-1) 39)
  ; 535,681 -> 148,704
  (road city-loc-1 city-loc-3)
  (= (road-length city-loc-1 city-loc-3) 39)
  ; 719,749 -> 535,681
  (road city-loc-4 city-loc-1)
  (= (road-length city-loc-4 city-loc-1) 20)
  ; 535,681 -> 719,749
  (road city-loc-1 city-loc-4)
  (= (road-length city-loc-1 city-loc-4) 20)
  ; 719,749 -> 856,721
  (road city-loc-4 city-loc-2)
  (= (road-length city-loc-4 city-loc-2) 14)
  ; 856,721 -> 719,749
  (road city-loc-2 city-loc-4)
  (= (road-length city-loc-2 city-loc-4) 14)
  ; 627,355 -> 535,681
  (road city-loc-6 city-loc-1)
  (= (road-length city-loc-6 city-loc-1) 34)
  ; 535,681 -> 627,355
  (road city-loc-1 city-loc-6)
  (= (road-length city-loc-1 city-loc-6) 34)
  ; 627,355 -> 856,721
  (road city-loc-6 city-loc-2)
  (= (road-length city-loc-6 city-loc-2) 44)
  ; 856,721 -> 627,355
  (road city-loc-2 city-loc-6)
  (= (road-length city-loc-2 city-loc-6) 44)
  ; 627,355 -> 719,749
  (road city-loc-6 city-loc-4)
  (= (road-length city-loc-6 city-loc-4) 41)
  ; 719,749 -> 627,355
  (road city-loc-4 city-loc-6)
  (= (road-length city-loc-4 city-loc-6) 41)
  ; 627,355 -> 546,132
  (road city-loc-6 city-loc-5)
  (= (road-length city-loc-6 city-loc-5) 24)
  ; 546,132 -> 627,355
  (road city-loc-5 city-loc-6)
  (= (road-length city-loc-5 city-loc-6) 24)
  (at package-1 city-loc-3)
  (at package-2 city-loc-4)
  (at package-3 city-loc-4)
  (at package-4 city-loc-1)
  (at package-5 city-loc-5)
  (at truck-1 city-loc-6)
  (capacity truck-1 capacity-3)
  (at truck-2 city-loc-5)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-loc-6)
  (at package-2 city-loc-6)
  (at package-3 city-loc-6)
  (at package-4 city-loc-4)
  (at package-5 city-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-2 city-loc-5 package-5 capacity-1 capacity-2)
   deleted: (at package-5 city-loc-5) (capacity truck-2 capacity-2)
   added: (in package-5 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 5
2. (drive truck-2 city-loc-5 city-loc-6)
   deleted: (at truck-2 city-loc-5)
   added: (at truck-2 city-loc-6)
   goals met: 0 of 5
3. (drive truck-2 city-loc-6 city-loc-1)
   deleted: (at truck-2 city-loc-6)
   added: (at truck-2 city-loc-1)
   goals met: 0 of 5
4. (pick-up truck-2 city-loc-1 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-loc-1) (capacity truck-2 capacity-1)
   added: (in package-4 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 5
5. (drive truck-2 city-loc-1 city-loc-3)
   deleted: (at truck-2 city-loc-1)
   added: (at truck-2 city-loc-3)
   goals met: 0 of 5
6. (drop truck-2 city-loc-3 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-0)
   added: (at package-5 city-loc-3) (capacity truck-2 capacity-1)
   goals met: 1 of 5
7. (pick-up truck-2 city-loc-3 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-loc-3) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 5
8. (drive truck-2 city-loc-3 city-loc-1)
   deleted: (at truck-2 city-loc-3)
   added: (at truck-2 city-loc-1)
   goals met: 1 of 5
9. (drive truck-2 city-loc-1 city-loc-6)
   deleted: (at truck-2 city-loc-1)
   added: (at truck-2 city-loc-6)
   goals met: 1 of 5
10. (drop truck-2 city-loc-6 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-loc-6) (capacity truck-2 capacity-1)
   goals met: 2 of 5
11. (drive truck-2 city-loc-6 city-loc-4)
   deleted: (at truck-2 city-loc-6)
   added: (at truck-2 city-loc-4)
   goals met: 2 of 5
12. (drop truck-2 city-loc-4 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-1)
   added: (at package-4 city-loc-4) (capacity truck-2 capacity-2)
   goals met: 3 of 5
13. (pick-up truck-2 city-loc-4 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-loc-4) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 3 of 5
14. (pick-up truck-2 city-loc-4 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-loc-4) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 3 of 5
15. (drive truck-2 city-loc-4 city-loc-6)
   deleted: (at truck-2 city-loc-4)
   added: (at truck-2 city-loc-6)
   goals met: 3 of 5
16. (drop truck-2 city-loc-6 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-0)
   added: (at package-2 city-loc-6) (capacity truck-2 capacity-1)
   goals met: 4 of 5
17. (drop truck-2 city-loc-6 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-1)
   added: (at package-3 city-loc-6) (capacity truck-2 capacity-2)
   goals met: 5 of 5
